; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star12 - direction
	Star14 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation13 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
)
(:goal (and
	(pointing satellite1 GroundStation6)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon16 spectrograph2)
	(have_image Star17 spectrograph0)
	(have_image Planet18 spectrograph2)
	(have_image Star19 infrared1)
	(have_image Planet20 infrared1)
	(have_image Phenomenon21 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation6 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 8
2. (turn_to satellite0 groundstation1 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon16 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon16 instrument0 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon15 instrument0 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite0 phenomenon21 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon21)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon21 instrument0 infrared1)
   added: (have_image phenomenon21 infrared1)
   goals met: 4 of 8
11. (turn_to satellite0 planet18 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 planet18)
   goals met: 4 of 8
12. (take_image satellite0 planet18 instrument0 spectrograph2)
   added: (have_image planet18 spectrograph2)
   goals met: 5 of 8
13. (turn_to satellite0 planet20 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet20)
   goals met: 5 of 8
14. (take_image satellite0 planet20 instrument0 infrared1)
   added: (have_image planet20 infrared1)
   goals met: 6 of 8
15. (turn_to satellite0 star17 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star17)
   goals met: 6 of 8
16. (take_image satellite0 star17 instrument0 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 7 of 8
17. (turn_to satellite0 star19 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star19)
   goals met: 7 of 8
18. (take_image satellite0 star19 instrument0 infrared1)
   added: (have_image star19 infrared1)
   goals met: 8 of 8
